//=================================================================
// [block.h]
// ブロック制御ヘッダ
// 制作者：野村 悠人	更新日：2023/09/04
//=================================================================
#pragma once		// インクルードガード


//=================================================================
// マクロ定義
//=================================================================
#define MAX_BLOCK		(5)		// 表示できるブロックの最大数
#define BLOCK_SIZE_X	(50.0f)	// ブロックのサイズ(X)
#define BLOCK_SIZE_Y	(50.0f)	// ブロックのサイズ(Y)


//=================================================================
// 構造体宣言
//=================================================================
typedef struct {
	Float2	pos;	// 座標
	Float2	oldPos;	// 1F前座標
	Float2	size;	// サイズ
	Float2  vel;	// 速度

	int		type;	// 表示するテクスチャの色(0 灰,1 青,2 緑,3 赤)
	bool	use;	// 使用フラグ
}BLOCK;

//=================================================================
// プロトタイプ宣言
//=================================================================
void InitBlock();
void UninitBlock();
void UpdateBlock();
void DrawBlock();
void SetBlock(Float2 size, Float2 vel);
BLOCK* GetBlock(void);
