//=================================================================
// [player.h]
// プレイヤー制御ヘッダ
// 制作者：野村 悠人	更新日：2023/08/29
//=================================================================
#pragma once		// インクルードガード

//=================================================================
// マクロ定義
//=================================================================
#define PLAYER_WIDTH (1000.0f)	// プレイヤー横幅
#define PLAYER_HEIGHT (64.0f)	// プレイヤー縦幅

//=================================================================
// 列挙体宣言
//=================================================================
typedef enum { // プレイヤーの傾き
	ANGLE_NORMAL = 0,
	ANGLE_LEFT,
	ANGLE_RIGHT,
	ANGLE_MAX
}PLAYER_ANGLE;

//=================================================================
// 構造体宣言
//=================================================================
typedef struct {
	Float2 pos;			// 座標
	Float2 size;		// サイズ
	Float2 vel;			// 速度
	Float2 jumpOldPos;	// ジャンプ前の座標
	Float2 displayPos;	// 表示用の座標
	PLAYER_ANGLE angle; // 傾き
	bool   jump;		// ジャンプフラグ
}PLAYER;

typedef struct {
	Float2 pos;		// 座標
	Float2 size;	// サイズ
	float rot;		// 角度
	bool use;		// 使用フラグ
}ARROW;

//=================================================================
// プロトタイプ宣言
//=================================================================
void InitPlayer();
void UninitPlayer();
void UpdatePlayer();
void DrawPlayer();
void JumpPlayer(void);
void SetStartAngle(Float3 angle);
PLAYER* GetPlayer(void); 

