//=================================================================
// [tutorial.cpp]
// チュートリアルシーン制御
// 制作者：野村 悠人	更新日：2023/09/04
//=================================================================
#include "main.h"
#include "controller.h"
#include "sound.h"
#include "tutorial.h"
#include "tutorialbg.h"
#include "fade.h"
#include "player.h"


//=================================================================
// グローバル変数
//=================================================================
Float3 getAngle;


//=================================================================
// 初期化処理
//=================================================================
void InitTutorial()
{
	InitTutorialBG();

	// BGMの再生
	PlayBGM(STRM_LOVELYFLOWER);
}


//=================================================================
// 終了処理
//=================================================================
void UninitTutorial()
{
	UninitTutorialBG();
}


//=================================================================
// 更新処理
//=================================================================
void UpdateTutorial()
{
	UpdateTutorialBG();

	// シーンの切り替え
	if (GetControllerTrigger(NpadButton::A::Index)) 
	{
		getAngle = GetControllerRightAngle();
		SetStartAngle(getAngle);

		// SEの再生
		PlaySE(WSD_SE_DECISION);
		SwapFade(FADE_OUT);
	}
}


//=================================================================
// 描画処理
//=================================================================
void DrawTutorial()
{
	DrawTutorialBG();
}
